Revit 2024 API
Reference Constructor
Creates a Reference with the supplied element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public Reference(
	Element element
)
Visual Basic
Public Sub New ( _
	element As Element _
)
Visual C++
public:
Reference(
	Element^ element
)
Parameters
element
Type: Autodesk.Revit.DB.Element
The element to create a reference.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  Thrown when the parameter is null.
See Also
Reference Class
Autodesk.Revit.DB Namespace